app/controllers/clientes_controller.rb

  def index
      @clientes = Cliente.all.order(:apellido)
---
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."apellido" ASC

  def create
    @cliente = Cliente.new(cliente_params)

    @cliente.update baja: true

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("cuit", "rubro", "apellido", "nombre", "domicilio", "barrio", "celular", "telefono", "correo", "tipo_cliente", "baja", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
        @cliente = Cliente.find(params[:id])
      if @cliente.update(cliente_params)
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "clientes" SET "observaciones_cliente" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["observaciones_cliente", "gggg"], ["updated_at", "2021-04-03 00:39:44.165532"], ["id", 1]]

  def delete
    @cliente = Cliente.find(params[:id])
    @cliente.update baja: false
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "clientes" SET "baja" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["baja", false], ["updated_at", "2021-04-01 05:41:19.991612"], ["id", 2]]

  def buscador
    @resultados = Cliente.buscador(params[:termino]).map do |cliente|
---
SELECT "clientes".* FROM "clientes" WHERE (apellido LIKE '%D%')

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]