app/controllers/orden_fumigacions_controller.rb

SELECT "orden_fumigacions".* FROM "orden_fumigacions" ORDER BY "orden_fumigacions"."nro_ordfumigacion" ASC
---
  def index
    @orden_fumigacions = OrdenFumigacion.all.order(:nro_ordfumigacion)

INSERT INTO "orden_fumigacions" ("cliente_id", "tecnico_id", "nro_ordfumigacion", "nro_certificado", "tipo_certificado", "fecha_aplicacion", "hora_aplicacion", "tratamiento", "vector", "superficie", "veneno", "droga", "observaciones_ordfumigacion", "fecha_vencimiento", "proximo_tratamiento", "importe", "estado", "baja", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @orden_fumigacion = OrdenFumigacion.new(orden_fumigacion_params)

    @orden_fumigacion.update baja: true

    respond_to do |format|
      if @orden_fumigacion.save

SELECT "orden_fumigacions".* FROM "orden_fumigacions" WHERE "orden_fumigacions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @orden_fumigacion = OrdenFumigacion.find(params[:id])

SELECT "orden_fumigacions".* FROM "orden_fumigacions" WHERE "orden_fumigacions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orden_fumigacions" SET "nro_ordfumigacion" = $1, "nro_certificado" = $2, "tipo_certificado" = $3, "fecha_aplicacion" = $4, "hora_aplicacion" = $5, "tratamiento" = $6, "vector" = $7, "superficie" = $8, "veneno" = $9, "droga" = $10, "observaciones_ordfumigacion" = $11, "fecha_vencimiento" = $12, "proximo_tratamiento" = $13, "updated_at" = $14 WHERE "orden_fumigacions"."id" = $15
---
  def update
        @orden_fumigacion = OrdenFumigacion.find(params[:id])
      if @orden_fumigacion.update(orden_fumigacion_params)

SELECT "orden_fumigacions".* FROM "orden_fumigacions" WHERE "orden_fumigacions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orden_fumigacions" SET "baja" = $1, "updated_at" = $2 WHERE "orden_fumigacions"."id" = $3  [["baja", false], ["updated_at", "2021-04-02 17:17:44.536850"], ["id", 1]]
---
  def delete
    @orden_fumigacion = OrdenFumigacion.find(params[:id])
    @orden_fumigacion.update baja: false

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def add_cliente
    @cliente = Cliente.find(params[:cliente_id])