app/controllers/pages_controller.rb

SELECT "orden_fumigacions".* FROM "orden_fumigacions" ORDER BY "orden_fumigacions"."nro_ordfumigacion" ASC
---
	def home
    	@orden_fumigacions = OrdenFumigacion.all.order(:nro_ordfumigacion)