app/controllers/quejas_controller.rb

  def index
      @quejas = Queja.all.order(:nro_queja)
---
SELECT "quejas".* FROM "quejas" ORDER BY "quejas"."nro_queja" ASC

  def create
    @queja = Queja.new(queja_params)

    @queja.update baja: true

    respond_to do |format|
      if @queja.save
---
INSERT INTO "quejas" ("orden_fumigacion_id", "nro_queja", "fecha_queja", "observaciones_queja", "estado", "baja", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @queja = Queja.find(params[:id])
---
SELECT "quejas".* FROM "quejas" WHERE "quejas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
        @queja = Queja.find(params[:id])
      if @queja.update(queja_params)
---
SELECT "quejas".* FROM "quejas" WHERE "quejas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "quejas" SET "estado" = $1, "updated_at" = $2 WHERE "quejas"."id" = $3  [["estado", "en proceso de garantia"], ["updated_at", "2021-04-03 00:03:02.786365"], ["id", 1]]

  def delete
    @queja = Queja.find(params[:id])
    @queja.update baja: false
---
SELECT "quejas".* FROM "quejas" WHERE "quejas"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "quejas" SET "baja" = $1, "updated_at" = $2 WHERE "quejas"."id" = $3  [["baja", false], ["updated_at", "2021-04-03 00:43:36.995819"], ["id", 4]]