app/controllers/tecnicos_controller.rb

  def index
      @tecnicos = Tecnico.all.order(:apellido)
---
SELECT "tecnicos".* FROM "tecnicos" ORDER BY "tecnicos"."apellido" ASC

  def create
    @tecnico = Tecnico.new(tecnico_params)

    @tecnico.update baja: true

    respond_to do |format|
      if @tecnico.save
---
INSERT INTO "tecnicos" ("dni", "apellido", "nombre", "barrio", "celular", "telefono", "correo", "observaciones_tecnico", "baja", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def edit
    @tecnico = Tecnico.find(params[:id])
---
SELECT "tecnicos".* FROM "tecnicos" WHERE "tecnicos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @tecnico = Tecnico.find(params[:id])
      if @tecnico.update(tecnico_params)
---
SELECT "tecnicos".* FROM "tecnicos" WHERE "tecnicos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tecnicos" SET "nombre" = $1, "domicilio" = $2, "updated_at" = $3 WHERE "tecnicos"."id" = $4  [["nombre", "ANABELLAa"], ["domicilio", ""], ["updated_at", "2021-04-03 00:40:29.965286"], ["id", 2]]