app/views/orden_fumigacions/new.html.erb

    	<%= f.label :cliente_id %>
    	<%= collection_select(:orden_fumigacion, :cliente_id, Cliente.all.order(:apellido), :id, :apellido, {prompt: 'Seleccione el Cliente'} ) %>
---
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."apellido" ASC

    	<%= f.label :tecnico_id %>
    	<%= collection_select(:orden_fumigacion, :tecnico_id, Tecnico.all.order(:apellido), :id, :apellido, {prompt: 'Seleccione el Tecnico'} ) %>
---
SELECT "tecnicos".* FROM "tecnicos" ORDER BY "tecnicos"."apellido" ASC